reproducibilityPackages/independenceStudy/openfoam/gridIndependence/h0.002/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version  2.0;
  format   ascii;
  class    dictionary;
  location "system";
  object   fvSolution;
}

//****************************************************************************//

solvers
{
  p
  {
    solver PCG;
    preconditioner  
    {
      preconditioner        GAMG;
      tolerance             1.0E-04;
      relTol                0;
      smoother              DICGaussSeidel;
      nPreSweeps            2;
      nPostSweeps           2;
      nFinestSweeps         2;
      cacheAgglomeration    true;
      nCellsInCoarsestLevel 10;
      agglomerator          faceAreaPair;
      mergeLevels           1;
    }
    tolerance 1.0E-06;
    relTol    0;
  }

  U
  {
    solver         PBiCG;
    preconditioner DILU;
    tolerance      1.0E-06;
    relTol         0;
  }
} // solvers

PISO
{
  nCorrectors              2;
  nNonOrthogonalCorrectors 0;
  pRefCell                 0;
  pRefValue                0;
} // PISO

//****************************************************************************//